{
  "contact": {
    "name": "Fan Guo",
    "website": "cfanguo.me",
    "email": "hello@cfanguo.me",
    "github": "github.com/cfan-guo",
    "linkedin": "linkedin.com/in/cfanguo"
  },
  "experience": [
    {
      "company": "Gobble",
      "website": "https://www.gobble.com/",
      "roles": [
        {
          "date": "August 2020 – Present",
          "position": "Senior Software Engineer",
          "experience": [
            "Designed and launched protein customization multiplier feature, adding additional revenue stream",
            "Engineered a new multistep approvals system and improved existing scripts to reduce weekly order generation process time by 25%",
            "Automated weekly menu item merge and deletion process, reducing Engineering and Culinary team effort"
          ]
        }
      ]
    },
    {
      "company": "Connected",
      "website": "https://www.connected.io/",
      "roles": [
        {
          "date": "April 2020 – August 2021",
          "position": "Engineering Manager",
          "experience": [
            "Held 1:1s with direct reports, collect feedback and facilitate progress"
          ]
        },
        {
          "date": "July 2018 – August 2021",
          "position": "Software Engineer",
          "experience": [
            "(JavaScript) Oversaw engineering team to create a custom DXF viewer using React and three.js.",
            "(Ruby) Improved unit test coverage, refactored for improved testability and fixed bugs in Connected’s mobile automation testing framework.",
            "(Java) Analyzed over 100 user-submitted bug reports to diagnose and triage pre-release software issues for a new video communication hardware device.",
            "(Python) Supported content management processes for AR experiences, serving a key coordinating function for three separate teams.",
            "(Hack) Migrated data annotation projects to a new platform by collaborating with the authors of the platform to create new workflows. Generalized and shared the process to be reusable by other teams. Supported other aspects of the transition, including performance and efficiency analysis, and coordinated testing and feedback."
          ]
        }
      ]
    },
    {
      "company": "Flipp",
      "website": "https://corp.flipp.com/",
      "roles": [
        {
          "date": "May 2016 – August 2017",
          "position": "Junior Software Engineer",
          "experience": [
            "Built and delivered customized desktop and mobile flyer themes and dynamic content for Canadian and US retailers on Flipp’s hosted platform using Ruby on Rails, JavaScript, HTML and Sass.",
            "The hosted platform serves over 1300 merchants, with over 180 highly custom desktop and 150 highly custom mobile experiences, including ecommerce integrations. Dynamic content on hosted platform receives over 213 million total views per month.",
            "Augmented the hosted digital flyer experience with interactive media for Canadian Tire to support integration between their flyer and ecommerce site.",
            "Oversaw and modernized dynamic content creation process for Menards, reducing developer time and overhead.",
            "Designed and implemented a custom, PII-compliant email registration endpoint on the flyers for Royal Ahold.",
            "Integrated live item stock and aisle information for The Home Depot.",
            "Developed store-specific interactive dynamic content maps for Walmart’s Black Friday strategy"
          ]
        }
      ]
    }
  ],
  "projects": [
    {
      "host": "4th Year Design Project",
      "date": "2017 – 2018",
      "name": "PillPal: an IoT multi-pill dispenser and management tool",
      "stack": [
        "ASP.NET Core",
        "C#",
        "ReactJS"
      ],
      "description": [
        "Developed and prototyped an application and devices to improve medication adherence in the elderly, with a focus on accessibility.",
        "Worked predominantly on physician dashboard design and integration with backend services."
      ]
    },
    {
      "host": "Flipp Internal Hackathon",
      "date": "July 2016",
      "name": "Onboarding script",
      "stack": [
        "BASH"
      ],
      "description": [
        "Compiled commands and setup instructions into a script that allowed the user to quickly set up a Ruby on Rails development environment.",
        "Reduced average set up time by 80%."
      ]
    }
  ],
  "honours": [
    {
      "date": "2018",
      "name": "CNIB Hochhausen Prize for Excellence in Accessible Design in Engineering for People who are Blind or Partially Sighted",
      "description": "Presented by the University of Toronto and CNIB for incorporating accessibility into the design of our project “PillPal: an IoT multi-pill dispenser and management tool”."
    },
    {
      "date": "2018",
      "name": "Certificate of Distinction for Excellence in Design Project",
      "description": "Selected to present at the ECE Final Design Showcase and ECE 4th Year and Alumni Celebration event for our project “PillPal: an IoT multi-pill dispenser and management tool”."
    },
    {
      "date": "2018",
      "name": "Engineering Athletics Association: Julie Wilkinson Award",
      "description": "Awarded to a graduating student in engineering for achievement in intramural athletics."
    },
    {
      "date": "2016",
      "name": "Huawei Seeds for the Future, Canadian Delegate",
      "description": "One of 18 delegates across Canada for an immersive two-week cultural and technical lab program in China to understand the roles of Canada and China in the global ICT market."
    }
  ],
  "education": [
    {
      "school": "University of Toronto, St. George Campus",
      "date": "2013 – 2018",
      "degree": "Bachelor of Applied Sciences in Computer Engineering",
      "activities": [
        "New College Residence Don",
        "Skule’s Got Talent",
        "University of Toronto Engineering Orientation",
        "University of Toronto Iron Dragons Dragonboat Team",
        "Skule Intramural Volleyball",
        "Skule Intramural Ultimate Frisbee"
      ]
    }
  ]
}